export interface IBlogProps {
	languagedata: any
}

export type BlogPreviewType = {
	img: string
	title: string
	detail: string
}

export const blogsPreview: Array<BlogPreviewType> = [
	{
		img: 'https://mkvector.com/wp-content/uploads/xsmall-kitchen-ideas-1-768x768.jpg.pagespeed.ic.G8zwhC55Bo.webp',
		title: 'Як використовувати обмежений простір кухні по максимуму',
		detail:
			'Кутові шафи, Використання кухонних фартуків, Дротовий посуд, Стеллаж для сушіння посуду, Корзина для мусора',
	},
	{
		img: 'https://mkvector.com/wp-content/uploads/2019/12/salon-bibliotheque-768x441.jpg',
		title: 'Книжкові шафи в інтер’єрі',
		detail:
			'Организація по кольору, Використання старинного стилю, Використання рослин в вашему декорі, Використання сторонніх об`єктів, Про декорі дитячих книжкових полиць,',
	},
	{
		img: 'https://mkvector.com/wp-content/uploads/2019/12/изображение_viber_2019-12-12_16-23-43.jpg',
		title: 'Баффелі — новый тренд интер’єру',
		detail: 'Який розмір бафелів вибрати, Які розміри баффелів ми виробляємо?',
	},
	{
		img: 'https://mkvector.com/wp-content/uploads/2019/12/Screenshot_12.jpg',
		title: 'Тумба під телевізор для спальні — як підібрати і замовити',
		detail:
			'Тумби під телевізор в спальню на замовлення, Урахування функціоналу',
	},
	{
		img: 'https://mkvector.com/wp-content/uploads/kitchen-design-modern-contemporary.jpg',
		title: '5 порад, перш ніж замовляти меблі для кухні',
		detail:
			'У цій статті ви отримаєте 5 найбільш корисних порад як уникнути помилки при замовленні меблів для кухні, які допоможуть вам не упустити важливі ключові моменти при замовленні',
	},
	{
		img: 'https://mkvector.com/wp-content/uploads/изображение_viber_2020-04-24_08-25-50-1.jpg',
		title: 'Гардеробна на замовлення на что звернути увагу і як вібрати',
		detail:
			'Які виміри необхідно зробити перед установкою гардероба, Де потрібно встановлювати гардероб, Якого кольору повинна бути моя гардеробна',
	},
	{
		img: 'https://mkvector.com/wp-content/uploads/1-4.png',
		title: '10 відмінних порад для дизайну кухні',
		detail:
			'Урахування органомікі кухні, Правильно використовуйте кухонний трикутник, Підсвідка на кухні - стиль і функціональність, Оптимізація простору для кухонних приборів',
	},
]

export type BlogType = {
	preview: BlogPreviewType
	article: Array<{ title: string; content: string[] }>
}

export const blogs: Array<BlogType> = [
	{
		preview: blogsPreview[0],
		article: [
			{
				title: 'Кутові шафи',
				content: [
					'Через їх обмежений простір, U-образний і L-образний дизайн кухні іноді втрачають свою функціональність і простір',
					'Щоб використовувати складні кутові простору, ви можете встановити кутові шафи. Сюди ви можете скласти ті предмети кухні, якими ви користуєтеся нечасто',
				],
			},
			{
				title: 'Використання кухонних фартуків',
				content: [
					'Фартух є функціональною частиною сучасного дизайну кухні. Це може захистити ваші стіни від пролиття під час приготування їжі',
					'Крім цього, він також може служити сховищем. Додавши магнітну смугу або вішалку на спинку, вона може тримати вашу посуд, ножі та кухонний посуд',
				],
			},
			{
				title: 'Дротовий посуд',
				content: [
					'Подумайте про дротяний посуд, щоб більш ефективно використовувати ваші шафи і ящики',
					'Це може допомогти максимально збільшити ваш простір для зберігання, дозволяючи вам організувати ваші кухонні предмети',
					'Це також може дати вам легкий доступ до вашого прихованого посуду і продуктів харчування з ваших шаф і комор',
				],
			},
			{
				title: 'Стеллаж для сушіння посуду',
				content: [
					'Придбайте складну підставку для сушки посуду з нержавіючої сталі. Це може усунути безлад і заощадити ваш цінне простір, так як ви можете просто покласти його в ящик після використання',
				],
			},
			{
				title: 'Корзина для мусора',
				content: [
					'Приміщення сміттєвих відер в один з ваших шаф може зменшити кількість безладу на вашій кухні',
					'Ви можете інтегрувати одну або два кошики в один з висувних ящиків. Таке розміщення дозволяє легко отримати доступ до сміттєвого баку під час приготування їжі',
				],
			},
		],
	},
	{
		preview: blogsPreview[1],
		article: [
			{
				title: 'Организація по кольору',
				content: [
					'Шанувальникам візуального порядку, без сумніву, сподобається цей прикрашає хід',
					'Варіації в ньому, здавалося б, нескінченні: ви можете організувати книги по райдужним малюнком, згрупувати книги за кольоровими блоками або вибрати всі книги в один відтінок',
					'Радимо поексперементувати з декількома варіантами, щоб побачити, що краще вписується в ваш простір',
				],
			},
			{
				title: 'Використання старинного стилю',
				content: [
					'Непоганим рішенням щодо декору буде використання старовинних книг, які додають історії на ваші полки',
					'Шукайте старовинні енциклопедії, довідники або набір розкішних романів, обв’язали шкірою, щоб додати до декору ноток Старого світу',
				],
			},
			{
				title: 'Використання рослин в вашему декорі',
				content: [
					'Найшвидший спосіб надати кімнаті стильний вигляд — посадити в неї рослина',
					'Полки є ідеальною платформою для демонстрації рослин. Вам не потрібні спеціальні стелажі — підійде книжкову шафу або плаваюча полку у вашій спальні або ванній кімнаті',
					'Урізноманітнити свої полки, включивши кілька рослин',
					'Квіти, зарослий плющ, фікуси: флора будь-яких форм, розмірів і сортів ідеально підходить для полиць, наповнених книгами',
				],
			},
			{
				title: "Використання сторонніх об'єктів",
				content: [
					'Пропонуємо наступну формулу розміщення книг на полицях шаф: складіть від трьох до шести книг по горизонталі, а потім обкласти їх іншими предметами які додадуть акцент — від предметів мистецтва в інших невеликих речей, ваз та інших',
					'Краще використовувати книги для журнальних столиків, оскільки вони мають велику площу поверхні',
				],
			},
			{
				title: 'Про декорі дитячих книжкових полиць',
				content: [
					'Коли ви прикрашаєте дитячі кімнати, важливо використовувати грайливий і практичний стиль',
					'Ви повинні створити простір, в якому дітям буде весело грати і проводити час, а також легко привести в порядок і організувати',
					'Додавайте іграшки та інші елементи декору на книжкові полиці, які будуть вписуватися в дитячу кімнату',
				],
			},
		],
	},
	{
		preview: blogsPreview[2],
		article: [
			{
				title: 'Який розмір бафелів вибрати?',
				content: [
					'Для стін і стель зазвичай використовують рейки меншого співвідношення сторін, наприклад 20 × 40, 30 × 40, 40х40 — саме такі розміри можна знайти в більшості дизайнерських проектів і рішень. Для рейкових перегородок рекомендуємо більше відношення сторін, наприклад 40 × 60, 40 × 80, 40×120мм — така перегородка буде стабільною і стійкою. Загальне правило таке — чим більше товщина рейкової перегородки, тим ефектніше вона виглядає і більше враження справляє',
				],
			},
			{
				title: 'Які розміри баффелів ми виробляємо?',
				content: [
					'Ми виробляємо абсолютно будь-які розміри рейок по товщині і ширині. Максимальна довжина або висота рейки: 4000мм (4 метри). Якщо ви не знайшли порібного розміру, залиште замовлення на нашому сайті для того щоб отримати консультацію з виготовлення баффелів змдф і ДСП',
					'Вартість завжди залежить від обраного матеріалу (модрина, бук, ясен або дуб) і розміру рейок',
				],
			},
		],
	},
	{
		preview: blogsPreview[3],
		article: [
			{
				title: 'Тумби під телевізор в спальню на замовлення',
				content: [
					'Жодна сучасна вітальня не може обійтися без полки для телевізора. Тумба під телевізор це також найважливіше доповнення для будь-якого декору квартири',
					'По-перше ідеальна тумба для телевізора повинна бути надійною, якщо використовувати лист ЛДСП недостатньої товщини, або заощадити на ребрах жорсткості, то з часом під вагою великого телевізора вона може прогнутися',
					'Тому дуже важливо заздалегідь передбачити майбутнє навантаження, можливо, крім телевізора там можуть бути встановлені інші прилади, наприклад, домашній кінотеатр. Для таких виробів ми застосовуємо більш товстий і надійний матеріал, але при цьому не менш привабливий',
					'Дверцята або бічні полиці, можливо, виконати зі скла, щоб можна було переглядати колекцію улюбленого фільмів, книг або інших цікавих речей, при цьому забезпечуючи їм захист від пилу',
				],
			},
			{
				title: 'Урахування функціоналу',
				content: [
					'Гарне оформлення це тільки півсправи, тумба для телевізора в спальню, яку можна замовити в Києві у нас повинна бути ще і практичною. Тут обов’язково повинна бути окрема полиця під ресивер, DVD-програвач (або інший пристрій для прийому сигналу), також обов’язково має бути продумано розташування проводів, прихований кабель-канал і доступність до розеток',
					'Також практичні тумби під телевізор на замовлення ми рекомендуємо робити разом з зручними полицями і висувними ящиками, в які можна покласти диски, пульти, перехідники, запасні дроти, джойстики від приставки та інші дрібниці. Як відомо, полки і ящики зайвими не бувають, і це ми враховуємо при розробці кожного проекту',
				],
			},
		],
	},
	{
		preview: blogsPreview[4],
		article: [
			{
				title: '1. Де що лежить? Зробіть список',
				content: [
					'Створіть список речей, які вам потрібні для вашої кухні. Запишіть необхідну техніку, шафи для зберігання, де і що буде лежати. Якщо ви любите готувати, вам може знадобитися простора стільниця. Подумайте про місце для розміщення посудомийки, холодильника, плити',
					'Наявність великої кількості місць для зберігання кухонних пристосувань і інвентарю також необхідно, щоб ваша кухня виглядала бажаної і вільної від перешкод',
					'Для вирішення цього питання проконсультуйтеся з фахівцем заздалегідь',
				],
			},
			{
				title: '2. Що з площею? Продумайте простір кухні',
				content: [
					'Подивіться на свою кухню і визначте, чи достатньо фактичного простору або чи потрібно його розширювати',
					'Якщо ви хочете створити багатофункціональну кухню, де ви можете одночасно готувати і обідати, ви можете прибрати стіну між вашою кухнею і їдальнею і об’єднати їх в одну',
					'Обговоріть зі своїм дизайнером кухні про те, як ви хотіли б отримати максимум від доступної площі',
				],
			},
			{
				title: '3. Чого я хочу? Збирайте натхнення',
				content: [
					'Збирайте посилання і фотографії з інтернету або зі сторінок журналів',
					'Зосередьтеся на дизайні який надихає вас і зверніть увагу на деталі: поверхні, матеріали та аксесуари, які привертають вашу увагу',
					'Це допоможе вашому дизайнеру кухні візуалізувати вашу мрію',
					'Від вашого вибору буде залежати ваш комфорт і затишок, тому підійдіть до цього питання обгрунтовано',
					'Пам’ятайте що на ранці ремонтів квартир та меблів на відбувається змішування стилів і домінує індивідуальність',
				],
			},
			{
				title: '4. Що саме мені потрібно? встановіть бюджет',
				content: [
					'Встановіть реалістичний бюджет. Це дозволить вам вибрати, у що вам слід інвестувати і де ви зможете заощадити',
					'Наприклад, відкриті полиці обійдуться вам дешевше, ніж закриті шафи. Те ж саме стосується кухонної техніки. На ринку корпусних меблів для кухонь встановлена фіксована ціна на загальну суму замовлення',
					'Все, що надається дешевше — це використання матеріалів низької якості і залучення не кваліфікованих фахівців, що в результаті призведе до великих тимчасових і фінансових витрат. Резюмуючи, пам’ятайте що ціна відповідає якості',
				],
			},
			{
				title:
					'5. Кого вибрати для виконання замовлення? Підберіть підходящу пропозицію',
				content: [
					'Хороший підрядник — відсутність витрати зайвого часу і сил при замовленні. Ви відправили заявку, отримали консультацію, підтвердили дизайн-проект і отримали готовий результат',
					'Ідеальний замовлення не повинен бути болем і проблемою. Для правильного вибору компанії, зверніть увагу на сайт, портфоліо і наявність відгуків',
					'Заздалегідь обговоріть вартість і терміни виконання робіт, закупівлі матеріалів',
					'Безспірне, по ходу виконання замовлення кухні завжди можуть виникнути непередбачені моменти, але краще звести їх до мінімуму',
				],
			},
			{
				title: 'І останнє…',
				content: [
					'Якщо вам потрібна кухня на замовлення, можете звернутися до наших фахівців і отримати професійну та повну консультацію по проекту',
					'Тому, що дизайн-проект і консультація тільки у нас є повністю безкоштовними!',
				],
			},
		],
	},
	{
		preview: blogsPreview[5],
		article: [
			{
				title: 'НАСКІЛЬКИ ВЕЛИКИМ ПОВИНЕН БУТИ МІЙ ГАРДЕРОБ?',
				content: [
					'Коли справа доходить до вашого гардеробу, розмір має значення. І при виборі пропорції потрібно враховувати дві речі: розмір вашої кімнати і розмір вашої колекції одягу',
					'Якщо ваша кімната знаходиться на невеликій стороні, вибирайте гардероб з однією або двома розсувними дверима. Наші маленькі шафи починаються з ширини 60 см для однієї людини і шириною 95 см для дводверного. Тим, у кого скромне кількість одягу, зазвичай може зійти з рук одне з перерахованих вище, в той час як запасниках одягу знадобиться подвійний',
					'Але те, що всередині, дійсно має значення. Подумайте, що вам потрібно зберігати, а також обсяг',
					'Якщо ви віддаєте перевагу складати, а не висіти, то вам знадобиться шафа з достатнім простором для скриньок. Точно так же, якщо вам потрібно повісити багато пальто і суконь, ваш кращий вибір — вищий гардероб з двома рейками',
					'Або, якщо ви хочете варіант, спеціально розроблений для ваших потреб, наші шафи Custom MADE забезпечать вас. Виберіть внутрішню упаковку для зберігання, а також колірну і рамкову обробку відповідно до вашим простором',
				],
			},
			{
				title: 'Які виміри необхідно зробити перед установкою гардероба?',
				content: [
					'Є три стандартних вимірювання, необхідно зробити при підборі нового гардероба: ширина, глибина і висота',
					'Виміряйте простір, яке у вас є, потім відведіть 10 см в сторону і 8 см зверху, щоб переконатися, що у вас достатньо місця для петель і збірки. Враховуйте також площа перед вашим гардеробом',
					'Немає кімнати для маневру? Немає проблем. Шафи-купе є відмінним варіантом, тому що вам не потрібно враховувати будь-які дорогоцінні дюйми для відкриваються назовні дверей. Розумна',
				],
			},
			{
				title: 'Де потрібно встановлювати гардероб?',
				content: [
					'Та локація, куди ви встановите свій гардероб, залежить від поточної планування і розміру вашої кімнати, але найбільш поширеним вибором є розміщення його навпроти або поряд з ліжком',
					'Не розміщуйте його біля дверей, так як вам може бути важко отримати доступ до своєї кімнати, коли шафа відкритий. Аналогічно, залиште достатньо місця, щоб пройти перед вашим гардеробом, коли його двері відкриті',
				],
			},
			{
				title: 'Якого кольору повинна бути моя гардеробна?',
				content: [
					'Вибираючи ідеальний колір гардеробу, в першу чергу враховуйте стиль своєї кімнати. Дерев’яні шафи — прості або пофарбовані в сірий, білий або синій — найкраще підходять для спальні в традиційному або скандинавському стилі',
					'Дзеркальні шафи з металевою або монохромного рамкою підійдуть кімнатах з промисловим відтінком',
				],
			},
		],
	},
	{
		preview: blogsPreview[6],
		article: [
			{
				title: 'Урахування органомікі кухні',
				content: [
					'Найголовніша мета — забезпечити процес виконання завдань на кухні максимально ефективним і приносить задоволення',
					'Для початку потрібно забезпечити правильне распеределеніе робочого простору',
					'Правильного розподілу техніки і меблів',
				],
			},
			{
				title: 'Правильно використовуйте кухонний трикутник',
				content: [
					'Кухонним трикутником називають мийку, плиту і холодильник. У просторі між ними відбувається основна робоча активність',
					'Планувати розташування цих елементів необхідно дуже ретельно, щоб забезпечити до них безперешкодний доступ під час вашої роботи',
				],
			},
			{
				title: 'Підсвідка на кухні - стиль і функціональність',
				content: [
					'Правильне освітлення — це одна зі складових ефектного дизайну будь-якого приміщення',
					'Приховані лампочки повинні бути розташовані над плитою мийкою і розділової зоною',
				],
			},
			{
				title: 'Оптимізація простору для кухонних приборів',
				content: [
					'Уважно розрахуйте висоту розміщення кухонних шафок і не забувайте про можливість мати приховані системи для зберігання кухонного начиння — вони дозволяють секоносіть ваш робочий простір',
				],
			},
			{
				title: 'Встановіть компактний бойлер на кухні',
				content: [
					'Навіть підключення до централізованої мережі водопостачання не гарантує стабільного і безперервного доступу до гарячої води',
					'Щоб не довелося «загартовуватися», намагаючись відмити тарілки в крижаній воді, доцільно встановити невеликий водонагрівач на кухні',
				],
			},
			{
				title: 'Острівне планування - новий тренд для кухонь',
				content: [
					'Острівне планування — порівняно молода тенденція в оформленні кухні. Кухонні острова увійшли в світ сучасного дизайну в кінці минулого століття і з кожним роком завойовують все більшу кількість шанувальників',
					'Якщо ваша кухня занадто велика — розмістіть меблі і стелажі в центральній частині кімнати',
				],
			},
			{
				title: 'Використовуйте більше розеток',
				content: [
					'На кухні завжди потрібно підключати побутові пристрої, телевізор, зарядити телефон і тд. Тут працює правило — чим більше розеток — тим краще',
				],
			},
			{
				title: 'Для кухонь підходить вологостійке покриття підлоги',
				content: [
					'Не використовуйте ламінат або паркетну дошку для вашої кухні. Дані матеріали мають властивість псується в результаті контакту з водою, а це може привести до проблем з виправленням і відповідно фінансових витрат',
				],
			},
			{
				title: "Oбов'язково використовуйте витяжку",
				content: [
					'Неприємний запах здатний зіпсувати враження від самого кращого дизайну інтер’єру. Багато хто вважає, що відкрита кватирка цілком може замінити примусову витяжку. Але це правило не працює',
				],
			},
			{
				title: 'Турбота про екологію при правильній утилізації',
				content: [
					'Не варто закривати очі на проблеми, пов’язані з екологією. Сучасна людина просто не може дозволити собі не думати про майбутнє. Керуйте своїм сміттям, встановивши окремі контейнери для різних видів відходів',
					'Це просте додаток до дизайну кухні продемонструє вашим гостям що ви мислячий і не безращлічний людина',
				],
			},
		],
	},
]
